app/controllers/blogs_controller.rb

  def show
    @blog = current_user.blogs.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? AND "blogs"."id" = ? LIMIT ?  [["user_id", 2], ["id", 7], ["LIMIT", 1]]

  def create

    @blog = Blog.new(blog_parameter)
    @blog.user_id = current_user.id
    if @blog.save
---
INSERT INTO "blogs" ("user_id", "title", "content", "start_time", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["user_id", 2], ["title", "これは"], ["content", "aaaaa"], ["start_time", "2021-11-08 10:11:00"], ["created_at", "2021-11-08 10:11:18.186750"], ["updated_at", "2021-11-08 10:11:18.186750"]]

  def destroy
    @blog = current_user.blogs.find(params[:id])
    @blog.destroy
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? AND "blogs"."id" = ? LIMIT ?  [["user_id", 2], ["id", 7], ["LIMIT", 1]]
DELETE FROM "blogs" WHERE "blogs"."id" = ?  [["id", 3]]

  def edit
    @blog = current_user.blogs.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? AND "blogs"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]

  def update
    @blog = current_user.blogs.find(params[:id])
    if @blog.update(blog_parameter)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."user_id" = ? AND "blogs"."id" = ? LIMIT ?  [["user_id", 2], ["id", 2], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "hggiol"], ["updated_at", "2021-11-17 11:38:57.488492"], ["id", 7]]