app/controllers/colors_controller.rb

SELECT "colors".* FROM "colors"
---
  def index
    @colors = Color.all