app/controllers/colors_controller.rb

SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @colors = current_user.colors.page(params[:page]).per(10).order('updated_at DESC').search(params[:search])

SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? AND "colors"."id" = ? LIMIT ?  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
---
  def show
    @color = current_user.colors.find(params[:id])

INSERT INTO "colors" ("user_id", "title", "detail", "color_image_id", "evaluation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def create
    @color = current_user.colors.new(color_parameter)
    if @color.save
      redirect_to colors_path, notice: "投稿完了"
    else
      @colors = current_user.colors.page(params[:page]).per(10).order('updated_at DESC')

SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? AND "colors"."id" = ? LIMIT ?  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
DELETE FROM "colors" WHERE "colors"."id" = ?  [["id", 2]]
---
  def destroy
    @color = current_user.colors.find(params[:id])
    @color.destroy

SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? AND "colors"."id" = ? LIMIT ?  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
---
  def edit
    @color = current_user.colors.find(params[:id])

SELECT  "colors".* FROM "colors" WHERE "colors"."user_id" = ? AND "colors"."id" = ? LIMIT ?  [["user_id", 2], ["id", 10], ["LIMIT", 1]]
UPDATE "colors" SET "detail" = ?, "updated_at" = ? WHERE "colors"."id" = ?  [["detail", "aaaaaaaaa"], ["updated_at", "2021-11-06 15:30:45.910590"], ["id", 1]]
---
  def update
    @color = current_user.colors.find(params[:id])
    if @color.update(color_parameter)