app/controllers/cuts_controller.rb

  def index
    @cuts = Cut.all
---
SELECT "cuts".* FROM "cuts"

  def create
    @cut = Cut.new(cut_parameter)
    if @cut.save
      redirect_to cuts_path, notice:"投稿完了"
    else
      @cuts = Cut.all
---
SELECT "cuts".* FROM "cuts"