app/controllers/cuts_controller.rb

SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "cuts"
---
  def index
    @cuts = current_user.cuts.page(params[:page]).per(10).order('updated_at DESC').search(params[:search])

SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? AND "cuts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def show
    @cut = current_user.cuts.find(params[:id])

INSERT INTO "cuts" ("user_id", "title", "detail", "cut_image_id", "evaluation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def create
    @cut = current_user.cuts.new(cut_parameter)
    if @cut.save
      redirect_to cuts_path, notice: "投稿完了"
    else
      @cuts = current_user.cuts.page(params[:page]).per(10).order('updated_at DESC')

SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? AND "cuts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
DELETE FROM "cuts" WHERE "cuts"."id" = ?  [["id", 2]]
---
  def destroy
    @cut = current_user.cuts.find(params[:id])
    @cut.destroy

SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? AND "cuts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 5], ["LIMIT", 1]]
---
  def edit
    @cut = current_user.cuts.find(params[:id])

SELECT  "cuts".* FROM "cuts" WHERE "cuts"."user_id" = ? AND "cuts"."id" = ? LIMIT ?  [["user_id", 2], ["id", 4], ["LIMIT", 1]]
UPDATE "cuts" SET "evaluation" = ?, "updated_at" = ? WHERE "cuts"."id" = ?  [["evaluation", 0], ["updated_at", "2021-11-06 15:30:10.087580"], ["id", 1]]
---
  def update
    @cut = current_user.cuts.find(params[:id])
    if @cut.update(cut_parameter)