app/controllers/perms_controller.rb

SELECT "perms".* FROM "perms"
---
  def index
    @perms = Perm.all

SELECT "perms".* FROM "perms"
---
  def create
    @perm = Perm.new(perm_parameter)
    if @perm.save
      redirect_to perms_path, notice:"投稿完了"
    else
      @perms = Perm.all