app/controllers/perms_controller.rb

SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def index
    @perms = current_user.perms.page(params[:page]).per(10).order('updated_at DESC').search(params[:search])

SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? AND "perms"."id" = ? LIMIT ?  [["user_id", 2], ["id", 14], ["LIMIT", 1]]
---
  def show
    @perm = current_user.perms.find(params[:id])

INSERT INTO "perms" ("user_id", "title", "detail", "perm_image_id", "evaluation", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? ORDER BY updated_at DESC LIMIT ? OFFSET ?  [["user_id", 2], ["LIMIT", 10], ["OFFSET", 0]]
---
  def create
    @perm = current_user.perms.new(perm_parameter)
    if @perm.save
      redirect_to perms_path, notice: "投稿完了"
    else
      @perms = current_user.perms.page(params[:page]).per(10).order('updated_at DESC')

SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? AND "perms"."id" = ? LIMIT ?  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
DELETE FROM "perms" WHERE "perms"."id" = ?  [["id", 2]]
---
  def destroy
    @perm = current_user.perms.find(params[:id])
    @perm.destroy

SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? AND "perms"."id" = ? LIMIT ?  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
---
  def edit
    @perm = current_user.perms.find(params[:id])

SELECT  "perms".* FROM "perms" WHERE "perms"."user_id" = ? AND "perms"."id" = ? LIMIT ?  [["user_id", 2], ["id", 16], ["LIMIT", 1]]
UPDATE "perms" SET "detail" = ?, "updated_at" = ? WHERE "perms"."id" = ?  [["detail", "aaaaaaaa"], ["updated_at", "2021-11-06 15:30:58.568850"], ["id", 3]]
---
  def update
    @perm = current_user.perms.find(params[:id])
    if @perm.update(perm_parameter)